et.org
* Implementation

#+begin_src clojure :tangle src/jakub_stastny/et/runner.clj :mkdirp yes
  (ns jakub-stastny.et.runner
    "........."
    (:gen-class)
    (:require [clojure.string :as str]
              [clojure.java.shell]
              [jakub-stastny.et.org :as org]))

  (defn abort [message]
    (throw (ex-info
            (str \u001b "[31m" "Error: " \u001b "[0m" message)
            {:babashka/exit 1})))

  (defn built-in-task--tasks
    ""
    [& args]
    (prn args)
    )

  (def built-in-tasks
    {:tasks built-in-task--tasks
     :help #(println "TODO: Implement built-in task :help")})

  (defn built-in-task [i]
    (cond
      (some #(= i %) ["-T" "--tasks"])
      {:name :tasks :fn (built-in-tasks :tasks)}

      true
      {:name :help :fn (built-in-tasks :help)}))

    ;; (defn show-task-in-ns [namespace]
    ;;   (prn (map (fn [t] {(t :name) ((t :opts) :doc)}) (filter-tasks namespace)))
    ;;   (println "\nIf you're not seeing some tasks, make sure they have :task yes in their begin_src options."))

    ;; (defn show-tasks-in-ns [namespaces]
    ;;   (doseq [namespace namespaces] (show-task-in-ns namespace)))
    ;; (defn show-all []
    ;;   (println "Show all ..."))

  (defn args-to-tasks [args]
    (reduce
     (fn [acc i]
       (cond
         ;; First argument starting with a dash (-T, -h etc).
         (and (empty? acc) (re-matches #"-{1,2}\w+" i))
         (conj acc {:task (built-in-task i)})

         (and
          (re-find #"\.org$" i)
          ;; -T is followed by an org file, not a task name.
          (not (= (get-in (last acc) [:task :name]) :tasks)))
         (conj acc {:path i :args [] :task {}})

         (and
          (nil? ((last acc) :task-name))
          ;; -T is followed by an org file, not a task name.
          (not (= (get-in (last acc) [:task :name]) :tasks)))
         (conj (butlast acc)
               (assoc-in (last acc) [:task-name] i))

         true
         (conj (butlast acc)
               (update-in (last acc) [:args] #(conj % i)))))
     []
     args))

  (defn task? ; TODO: Use it.
    "..."
    [example]
    (or (example :task) (example :doc)))

  (def default-config
    {:args-to-tasks args-to-tasks
     :exts {:clojure "clj" :emacs-lisp "el"}
     :cmds {:clojure "clojure -M"} ; -M -m to run -main OR bb
     :exec-fn clojure.java.shell/sh})

  (defn run-task [task config]
    (println (str "~ Task definition " (pr-str task)))
    (cond
      ;; Built-in task.
      (get-in task [:task :fn])
      ((get-in task [:task :fn]))

      ;; Org-defined task.
      (and (task :path) (task :task-name))
      (org/run-task task config)

      ;; Should never get here.
      true
      (abort "Nope")))

  ;; TODO: spec: validate keys of config.
  (defn run
    "....."
    ([args] (run {} args))

    ([custom-config args]
     (let [config (conj default-config custom-config)]
       (let [defs
             (try ((config :args-to-tasks) args)
                  (catch Exception e
                    (println "E")))]
         (doseq [def defs] (run-task def config))))))

  ; Main entry point if the default runner is used.
  (defn -main [& args] (run args))
#+end_src

#+begin_src clojure :tangle src/jakub_stastny/et/org.clj :mkdirp yes
  (ns jakub-stastny.et.org
    "...."
    (:require [clojure.string :as str]
              [clojure.java.io :as io]
              [clojure.java.shell :refer [sh]] ; chmod +x
              [jakub-stastny.et.parser :as parser]))

  (defn load-tasks
    "..."
    [path]
    (if (.exists (io/as-file path))
      (parser/parse-examples (str/split (slurp path) #"\n"))
      (println "ERR")))

  (defn write-script-2
    "...."
    [script-name command lines]
    (let [shebang (str "#!/usr/bin/env " command)
          indent (re-find #"^ *" (first lines))]
      (spit script-name
            (str/join "\n"
                      (apply conj
                             [shebang ""]
                             (map
                              (fn [line]
                                (str/replace line indent "")) (conj lines "")))))
      (sh "chmod" "+x" script-name)))

  (defn get-ext
    "..."
    [exts lang] (or (get exts (keyword lang)) lang))

  (defn get-cmd
    "..."
    [cmds lang] (or (get cmds (keyword lang)) lang))

  ; TODO: don't rewrite if same.
  (defn write-script
    "....."
    [{:keys [name lang lines opts]} {:keys [exts cmds]}]
    (let [shebang (if (opts :shebang)
                    (str/split (str/replace (opts :shebang) #"#!" "") #"\s+")
                    (str/split (get-cmd cmds lang) #"\s+"))
          script-name (str "/tmp/" name "." (get-ext exts lang))]
      (write-script-2 script-name (str/join " " shebang) lines)

      (conj shebang script-name)))

  (defn exec-task
    "..."
    [task task-def config]
    (println (str "~ Running task " (task :name) " " (pr-str (task :opts))))
    (let [exec-fn (config :exec-fn)
          base-command (write-script task config)
          command (apply conj base-command (task-def :args)) ; args are in tdef, not task.
          res (apply exec-fn command)]
      (println)
      ;; With exec it'll never run so no prob.
      ;; (prn command) (prn res) (println)
      (if (= (res :exit) 0)
        (println (str/trim (res :out)))
        (println (str/trim (res :err))))
      (System/exit (res :exit))))

  (defn run-task
    "..."
    [task-def config]
    (let [examples (load-tasks (task-def :path))
          tasks (filter #(= ((% :opts) :task) (symbol "yes")) examples)
          task (first (filter #(= (task-def :task-name) (% :name)) tasks))]
      (if task
        (exec-task task task-def config)
        (println (str "No such task " (task-def :task-name) "\n\nAvailable tasks: " (pr-str tasks))))))
  ;; (abort (str "No such task: " task-name "\nTasks in this namespace: ...."))

  ;; (defn filter-tasks [namespace]
  ;;     (filter (fn [task]
  ;;             (= (symbol "yes") ((task :opts) :task)))
  ;;     (parse-examples (get-lines-or-abort namespace))))


  ;;    (defn run [fully-qualified-task-name]
  ;;      (let [namespace (first (str/split fully-qualified-task-name #"/"))
  ;;            task-name (last (str/split fully-qualified-task-name #"/"))
  ;;            lines (get-lines-or-abort namespace)
  ;;            tasks (filter-tasks namespace)]
  ;;        (exec tasks task-name)))
  ;;            (run a)))
  ;; (defn convert-ns-to-path [namespace]
  ;;   (when (or (re-find #"[/:]" namespace))
  ;;     (throw (Exception. "Namespace uses . rather than /")))
  ;;   (str (str/replace namespace #"\." "/") ".org"))

  ;; (prn (babel-to-map ""))
  ;; (prn (babel-to-map ":tangle test.clj"))
  ;; (prn (babel-to-map ":tangle \"test.clj\""))
  ;; (prn (babel-to-map ":shebang \"#!/usr/bin/env clojure -M\""))
  ;; (prn (babel-to-map ":task yes :shebang \"#!/usr/bin/env clojure -M\""))
  ;; (println)
  ;; (System/exit 1)
#+end_src

#+begin_src clojure :tangle src/jakub_stastny/et/parser.clj :mkdirp yes
  (ns jakub-stastny.et.parser
    "...."
    (:require [clojure.string :as str]
              [clojure.edn :as edn]))

  (defn parse-var [line]
  (str/trim (str/replace line #"^\s*#\+\w+:?(.*)$" "$1")))

  (defn babel-to-map [string]
      (edn/read-string (str "{" string "}")))

  (defn parse-examples [lines]
    (let [update-last-task
          (fn [tasks update-fn]
            (conj
             (vec (butlast tasks))
             (conj (last tasks) (update-fn (last tasks)))))]

      (first
       (reduce
        (fn [[tasks status] line]
          ;; (prn {:t tasks :s status :l line}) ; --------------
          (cond
            ;; Read name.
            (re-find #"^\s*#\+(?i)name:" line)
            [(conj tasks {:name (parse-var line)}) :named]

            ;; Read block options.
            (and (re-find #"^\s*#\+(?i)begin_src" line)
                 (= status :named))
            [(update-last-task
              tasks
              (fn [task]
                (let [raw-opts (str/split (parse-var line) #"\s+")
                      lang (first raw-opts)
                      opts (babel-to-map (str/join " " (rest raw-opts)))]
                  {:lines [] :lang lang :opts opts})))
             :reading]

            ;; Stop reading block body.
            ;; We do need this line even though it does the same
            ;; as the default cond so the end_src line gets skipped.
            (re-find #"^\s*#\+(?i)end_src" line)
            [tasks nil]

            ;; Read body.
            (= status :reading)
            [(update-last-task
              tasks
              (fn [task] {:lines (vec (conj (:lines task) line))}))
             :reading]

            :default [tasks nil]))
        [[] nil]
        lines))))
#+end_src
